## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/5796219374)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "github_webhook_gateway" {
      ~ id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/github-webhook-gateway" -> (known after apply)
        name                       = "github-webhook-gateway"
      ~ project                    = "sap-kyma-prow" -> (known after apply)
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = "Revision 'github-webhook-gateway-00001-jqr' is not ready and cannot serve traffic. Image 'europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/github-webhook-gateway:v20230802-a960e47d' not found."
                      - reason  = "RevisionFailed"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = "Revision 'github-webhook-gateway-00001-jqr' is not ready and cannot serve traffic. Image 'europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/github-webhook-gateway:v20230802-a960e47d' not found."
                      - reason  = "RevisionFailed"
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "github-webhook-gateway-00001-jqr"
              - latest_ready_revision_name   = ""
              - observed_generation          = 1
              - traffic                      = []
              - url                          = ""
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "run.googleapis.com/ingress"        = "all" -> null
              - "run.googleapis.com/ingress-status" = "all" -> null
              - "run.googleapis.com/operation-id"   = "1a113dfe-6fd5-4e23-a791-769cfdc3bcf9" -> null
              - "serving.knative.dev/creator"       = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
              - "serving.knative.dev/lastModifier"  = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
                # (1 unchanged element hidden)
            }
          ~ generation       = 1 -> (known after apply)
          ~ labels           = {
              - "cloud.googleapis.com/location"   = "europe-west3"
              - "run.googleapis.com/satisfiesPzs" = "true"
            } -> (known after apply)
          ~ namespace        = "sap-kyma-prow" -> (known after apply)
          ~ resource_version = "AAYCZ30R0O0" -> (known after apply)
          ~ self_link        = "/apis/serving.knative.dev/v1/namespaces/351981214969/services/github-webhook-gateway" -> (known after apply)
          ~ uid              = "dc4dc77d-6d02-4303-87af-4b670dd4d7fb" -> (known after apply)
        }

      ~ template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                } -> null
              - generation  = 0 -> null
              - labels      = {
                  - "run.googleapis.com/startupProbeType" = "Default"
                } -> null
            }
          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                  + name    = (known after apply)
                    # (1 unchanged attribute hidden)

                  - ports {
                      - container_port = 8080 -> null
                      - name           = "http1" -> null
                    }

                  - resources {
                      - limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> null
                      - requests = {} -> null
                    }

                  - startup_probe {
                      - failure_threshold     = 1 -> null
                      - initial_delay_seconds = 0 -> null
                      - period_seconds        = 240 -> null
                      - timeout_seconds       = 240 -> null

                      - tcp_socket {
                          - port = 8080 -> null
                        }
                    }

                    # (7 unchanged blocks hidden)
                }

              ~ volumes {
                    name = "gh-tools-kyma-bot-token"

                  ~ secret {
                      - default_mode = 0 -> null
                        # (1 unchanged attribute hidden)
                    }
                }
            }
        }

      - traffic {
          - latest_revision = true -> null
          - percent         = 100 -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_project_iam_member.terraform_executor_prow_project_owner has changed
  ~ resource "google_project_iam_member" "terraform_executor_prow_project_owner" {
      ~ etag    = "BwYCZzZsCCw=" -> "BwYCZ35k9eo="
        id      = "sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":8583,"Program":"tfcmt","SHA1":"707e33c76e58b3d77ca0c842312794b2c6bb509b","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->